{
    "courses": [
        {
            "name": "Python & Django REST API Bootcamp – Build A Python Web API",
            "category": "Development",
            "image": "https://img-c.udemycdn.com/course/480x270/3769792_3990_5.jpg",
            "actual_price_usd": 84.99,
            "sale_price_usd": 0.0,
            "sale_end": "2025-01-24T10:51:00",
            "description": "Do you want to build a complete Python RESTful API that is not only secure and stable but also deployed to a production ready environment ready to serve thousands of users?  If Yes! Then this is the course for you! WHAT WILL WE BE BUILDING? In this course, we’ll use the best in Python and Django Rest Framework to build a complete REST API from scratch to deployment called Taskly that you can consume with any frontend framework of your choice. WHAT CONCEPTS ARE COVERED? JWT and OAUTH-2 Based Authentication Support for Filtering and Text Based Searching Create, Read, Update, Delete Functionality Protecting and Permissioning Routes Defining Custom Permissions For Users Uploading and Sharing Of Media Files Background Jobs Django Signals PostgresSQL and SQLite Databases alongside Django ORM Throttling and Pagination Support Deploying Django REST API to a Production Environment (Heroku) Use Google Cloud Storage as Media Storage Solution (CDN). Use Postman for testing REST API. Tons of Practical, Straightforward and Repeatable App-Building Patterns ​ And much more!​ WHAT ELSE DOES THIS COURSE OFFER? –  Deep, Fine-Grained Learning  – This course is jam-packed with information. I made the course that I most wanted to take and as a result, I didn’t skimp on the details. You’re going to cover more topics and material in greater depth than ever before. –  100% Real-World Practice  – My goal is to get you writing code as much as possible. And not just any code–we’ll be working exclusively on practical tasks that are instrumental in building your own amazing real-world apps. –  No-Nonsense, Spot-On Explanations –  Every lesson is to-the-point. I break down what we’re making, how we’ll be doing it and what the final product will look like, all on top of helpful and illustrative descriptions to aid your understanding along the way. I really enjoyed making this course and I think you’ll enjoy taking it just as much. Looking forward to seeing you within the course! Who this course is for: Python and web developers looking to build impressive real-world, production-ready RESTful API’s using Python and Django Rest Framework! Python developers looking for a challenge Developers looking to delve into the world of backend development.",
            "url": "https://www.udemy.com/course/the-complete-python-django-rest-api-development-bootcamp/?couponCode=EE34AA06610150B2950B",
            "clean_url": "https://www.udemy.com/course/the-complete-python-django-rest-api-development-bootcamp/"
        },
        {
            "name": "[NEW] Python PCAP-31-03 Certification – Tests & Insights",
            "category": "IT & Software",
            "image": "https://img-c.udemycdn.com/course/480x270/6280705_b1ff_3.jpg",
            "actual_price_usd": 19.99,
            "sale_price_usd": 0.0,
            "sale_end": "2025-01-26T18:07:00",
            "description": "Python PCAP-31-03 Certification - Tests & Insights , Prepare for your Python Certification PCAP-31-03 (2024) with 6 Practice Tests - Detailed Explanations ...",
            "url": "https://www.udemy.com/course/python-pcap-31-03-certification-practice-exam-preparation/?couponCode=AA12B1022FAFC980FE2D",
            "clean_url": "https://www.udemy.com/course/python-pcap-31-03-certification-practice-exam-preparation/"
        },
        {
            "name": "PYTHON INTERVIEW PREPARATION",
            "category": "IT & Software",
            "image": "https://img-c.udemycdn.com/course/480x270/6060673_b355.jpg",
            "actual_price_usd": 799000.0,
            "sale_price_usd": 0.0,
            "sale_end": "2025-01-22T20:00:00",
            "description": "PYTHON INTERVIEW PREPARATION, Prepare for Python Interviews With A Wide Variety Of In-Depth Practice Questions.\r\n\r\n \r\nCourse Description\r\n\r\n\r\n\r\n\r\nEmbark ...",
            "url": "https://www.udemy.com/course/python-interview-prep/?couponCode=7ECA8DA5B25ED958EE32",
            "clean_url": "https://www.udemy.com/course/python-interview-prep/"
        },
        {
            "id": "11872",
            "sku": "6414649",
            "pic": "https://img-c.udemycdn.com/course/750x422/6414649_acc5_2.jpg",
            "title": "Mastering Influencer Marketing: Strategies for Success",
            "coupon": "https://www.udemy.com/course/mastering-influencer-marketing-strategies-for-success-m/?couponCode=312EC76246D510353A15",
            "org_price": "$9.99",
            "desc_text": "In the rapidly evolving digital landscape, influencer marketing has become a powerful tool for brands looking to connect with their audience authentically and effectively. The course Mastering Influencer Marketing: Strategies for Success provides participants with a deep understanding of what influencer marketing is and why it has become a crucial component of modern marketing strategies. Through this course, learners will explore how influencers can drive brand awareness, enhance engagement, and ultimately contribute to increased sales, making it an essential skill for marketers and business owners alike.\nA key focus of the course is learning how to identify and collaborate with influencers who genuinely align with your brand’s values and target audience. Participants will gain insights into the different types of influencers—nano, micro, macro, and mega—and understand how to choose the right ones based on their niche, reach, and engagement levels. By building authentic relationships, brands can ensure that their partnerships are not only effective but also resonate well with the audience, fostering trust and loyalty. The course also dives into the practical aspects of designing, implementing, and measuring influencer marketing campaigns. Learners will discover strategies for creating campaigns that align with their brand’s objectives, setting clear goals, and establishing metrics for success. From content creation and storytelling to budget management and performance tracking, participants will be equipped with the tools and knowledge to execute campaigns that deliver measurable results.\nStaying updated with the latest trends and challenges in influencer marketing is another essential component of the course. Participants will explore emerging trends, such as the rise of micro-influencers, the increasing importance of authenticity, and the use of data analytics to drive decision-making. By the end of the course, learners will be well- prepared to leverage influencer marketing as a strategic tool for brand growth and success.\nThe objective of the course & Mastering Influencer Marketing: Strategies for Success is to equip participants with a comprehensive understanding of influencer marketing and its role in today’s digital landscape. The course aims to provide the knowledge and skills needed to identify and collaborate with influencers who align with brand values, design and implement effective marketing campaigns, and measure their success. By staying updated on the latest trends and challenges, participants will be empowered to understand data-driven strategies and tools that enhance brand visibility, foster authentic engagement, and drive sustainable growth in an increasingly competitive marketplace",
            "category": "Marketing",
            "language": "English",
            "platform": "Udemy",
            "rating": 3.8,
            "duration": 1,
            "expiry": "2025-01-31T16:24:08.508Z",
            "savedtime": "2025-01-26T16:24:08.508Z"
        },
        {
            "id": "11919",
            "sku": "5436836",
            "pic": "https://img-c.udemycdn.com/course/750x422/5436836_736b_3.jpg",
            "title": "PHP Laravel 2024: Build Amazing Restaurant Management System",
            "coupon": "https://www.udemy.com/course/php-laravel-2023-build-amazing-restaurant-management-system/?couponCode=LARAVELRESTAURANT56",
            "org_price": "$9.99",
            "desc_text": "If you’re looking for a comprehensive online course that covers the latest version of PHP Laravel and teaches you how to build an amazing restaurant management system from scratch, you’ve come to the right place. My course “PHP Laravel 2024: Build Amazing Restaurant Management System” includes everything you need to know to develop a powerful and efficient restaurant management system using the latest features of Laravel, the industry-standard PHP web framework.\nWith hands-on project-based learning, you’ll develop essential skills in database and application design, user authentication, security mechanisms, and payment processing, that will allow you to create a fully functional, user-friendly, and secure restaurant management system. I will guide you every step of the way.\nWhat makes this course unique is that I focus on building a production-ready application that includes all the essential components such as menu management, online ordering, reservations, payments, review system, and more. You’ll also learn how to customize the application further to meet your specific business requirements.\nI have a lot of experience in designing various enterprise-level applications and will help you develop real-world skills along with an in-depth understanding of how to leverage the power of PHP Laravel. You’ll get access to all course materials for life, and our team is always available to assist you in case of any questions or concerns.\nHere are some of the key features of the course:\nLearn Laravel installation and setup\nBuild a database schema for restaurant menus, orders, and reservations\nCreate models, controllers, and views for restaurant menus, orders, and reservations\nImplement user authentication and authorization\nIntegrate PayPal API for payment processing and online ordering\nBuild a dashboard for restaurant managers and staff\nCreate a menu management system\nCreate  a table reservation system\nCreate a customer ordering system and so much more\nEnroll now and take the first step towards building your own restaurant management system using PHP Laravel – the preferred framework of industry professionals. Let’s get started!",
            "category": "Development",
            "language": "English",
            "platform": "Udemy",
            "rating": 4.5,
            "duration": 9,
            "expiry": "2025-01-31T16:24:08.508Z",
            "savedtime": "2025-01-26T16:24:08.508Z"
        },
        {
            "id": "11920",
            "sku": "5605600",
            "pic": "https://img-c.udemycdn.com/course/750x422/5605600_4158_6.jpg",
            "title": "Build ML Projects on AWS Master SageMaker",
            "coupon": "https://www.udemy.com/course/mastering-aws-sage-maker-from-fundamentals-to-advance/?couponCode=FESTIVALYEAR",
            "org_price": "$9.99",
            "desc_text": "Course Description:\nUnlock the full potential of AWS SageMaker and become a machine learning and data science expert with our comprehensive “Mastering AWS SageMaker” course. Whether you are a beginner looking to explore the world of machine learning or a seasoned professional seeking to enhance your skills, this course is your key to mastering the AWS SageMaker platform.\nCourse Highlights:\nFundamentals of AWS SageMaker: Begin your journey by understanding the core concepts of AWS SageMaker, cloud computing, and machine learning. You’ll gain insights into the key components of SageMaker and how they fit into the machine-learning workflow.\nData Preprocessing and Feature Engineering: Learn how to prepare and preprocess data for machine learning, an essential step in building robust models. Explore feature engineering techniques to extract meaningful insights from your data.\nModel Building and Training: Dive into the heart of machine learning by creating, training, and fine-tuning models on SageMaker. Understand various algorithms, optimization strategies, and hyperparameter tuning for better model performance.\nDeploying Models: Discover how to deploy your machine learning models into production with SageMaker. You’ll explore best practices for deploying models at scale, ensuring high availability, and achieving optimal performance.\nAutomated Machine Learning (AutoML): Uncover the power of AutoML with SageMaker, allowing you to automate many aspects of the machine learning process, saving you time and effort in model development.\nMLOps and Model Monitoring: Learn how to implement MLOps best practices and set up automated model monitoring to ensure your deployed models remain accurate and reliable.\nAdvanced Topics: Delve into advanced topics such as natural language processing (NLP), computer vision, and reinforcement learning on AWS SageMaker. Explore real-world use cases and applications.\nHands-On Projects: Throughout the course, you will work on practical projects and exercises, applying what you’ve learned to real-world scenarios.\nCertification Preparation: If you’re looking to earn AWS certification in machine learning, this course provides a strong foundation to help you succeed in your certification exam.\nWho Should Enroll:\nData scientists and analysts\nSoftware developers\nMachine learning engineers\nData engineers\nIT professionals\nAnyone interested in mastering AWS SageMaker and machine learning",
            "category": "Data Science",
            "language": "English",
            "platform": "Udemy",
            "rating": 1.5,
            "duration": 1,
            "expiry": "2025-01-31T16:24:08.508Z",
            "savedtime": "2025-01-26T16:24:08.508Z"
        },
        {
            "id": "11921",
            "sku": "5972478",
            "pic": "https://img-c.udemycdn.com/course/750x422/5972478_958a_2.jpg",
            "title": "The Complete T-Shirt Design Toolkit: PS, AI & Canva",
            "coupon": "https://www.udemy.com/course/the-complete-t-shirt-design-toolkit-ps-ai-canva/?couponCode=70F6B574D0D278D61599",
            "org_price": "$9.99",
            "desc_text": "Turn your T-shirt ideas into reality with this comprehensive course!\nMaster the in-demand skills of T-shirt design using the industry’s leading software (Adobe Photoshop, Illustrator) and the beginner-friendly Canva. This course is your one-stop shop for creating professional-quality T-shirt designs, from concept to print.\nWhether you’re a complete beginner or looking to refine your skills, this course provides everything you need. You’ll learn:\nFoundational design principles: Understand core concepts like composition, color theory, and typography to create visually appealing designs.\nMastering Adobe Photoshop & Illustrator: Learn the essential tools and techniques used by professional T-shirt designers in both Photoshop and Illustrator.\nCanva for T-shirt design: Discover how to leverage the user-friendly interface of Canva to create stunning designs, perfect for beginners.\nT-shirt design workflow: Grasp the entire process, from brainstorming ideas to finalizing your artwork for printing.\nCreating mockups and presentations: Showcase your designs professionally using mockup templates.\n(Optional) Printing and selling your T-shirts: Explore various printing methods and platforms to turn your designs into sellable products.\nBy the end of this course, you’ll be confident in:\nCreating unique and eye-catching T-shirt designs.\nUsing industry-standard software (and a beginner-friendly alternative) to bring your ideas to life.\nPreparing your designs for professional printing.\n(Optional) Launching your own T-shirt business.\nThis course is perfect for:\nAspiring T-shirt designers\nEntrepreneurs looking to create their own clothing line\nAnyone who wants to learn in-demand design skills\nCreatives who want to express themselves through T-shirt design\nSign up today and unlock your T-shirt design potential!\nNote:\nYou can adjust the description length based on Udemy’s requirements.\nEmphasize the strengths of your course, like including both industry-standard and beginner-friendly software.\nClearly outline the learning outcomes and target audience.",
            "category": "Design",
            "language": "English",
            "platform": "Udemy",
            "rating": 4.7,
            "duration": 6,
            "expiry": "2025-01-31T16:24:08.508Z",
            "savedtime": "2025-01-26T16:24:08.508Z"
        },
        {
            "id": "11922",
            "sku": "5585740",
            "pic": "https://img-c.udemycdn.com/course/750x422/5585740_906e_6.jpg",
            "title": "Advanced DataBricks -Data Warehouse Performance Optimization",
            "coupon": "https://www.udemy.com/course/advanced-databricks-data-warehouse-performance-optimization/?couponCode=FESTIVALYEAR",
            "org_price": "$9.99",
            "desc_text": "Welcome to the “Advanced Data Warehouse Performance Optimization and Data Processing with UDFs – Databricks Intermediate” course, where you’ll take your skills in data warehousing and analytics to the next level using the powerful Databricks platform. In this intermediate-level course, we’ll dive deep into the art and science of optimizing data warehouse performance and harnessing the capabilities of User-Defined Functions (UDFs) for advanced data processing.\nCourse Highlights:\n1. Advanced Databricks Setup: Begin by setting up an advanced Databricks environment, including cluster configuration and integration with data sources, to prepare for performance optimization and UDF development.\n2. Data Warehouse Optimization: Explore advanced techniques for optimizing data warehousing workloads. Learn how to fine-tune performance by optimizing data storage, partitioning strategies, and query optimization.\n3. Profiling and Diagnostics: Master the art of profiling and diagnosing performance bottlenecks in your data warehouse workloads. Identify and address performance issues to ensure smooth data processing.\n4. Leveraging User-Defined Functions (UDFs): Understand the power of User-Defined Functions (UDFs) in Databricks. Create and utilize UDFs to perform custom data transformations and calculations, expanding the capabilities of your data processing pipelines.\n5. Data Lake Integration: Learn how to seamlessly integrate Databricks with data lakes, enabling efficient data extraction, transformation, and loading (ETL) processes. Explore best practices for managing data lakes.\n6. Real-time Data Processing: Explore real-time data processing scenarios using Databricks Streaming. Discover how to ingest, process, and analyze streaming data for timely insights.\n7. Advanced Data Analytics: Go beyond basic analytics. Explore advanced analytics techniques, including machine learning and predictive analytics, using Databricks libraries and tools.\n8. Scalable Data Processing: Understand how to scale your data processing workloads to handle large datasets and complex computations effectively. Utilize Databricks clusters for parallel processing.\n9. Monitoring and Performance Tuning: Gain proficiency in monitoring data warehouse performance and fine-tuning your Databricks workloads for optimal efficiency and resource utilization.\n10. Best Practices and Case Studies: Learn from real-world case studies and industry best practices. Explore how organizations have achieved significant performance improvements and advanced data processing capabilities using Databricks.\nThis course is designed for intermediate learners who already have a foundational understanding of Databricks and data warehousing concepts. By the end of this course, you’ll have the skills and knowledge to optimize data warehouse performance, develop and deploy UDFs for advanced data processing, and handle complex data analytics scenarios with confidence.",
            "category": "Database Design & Development",
            "language": "English",
            "platform": "Udemy",
            "rating": 2.83,
            "duration": 1,
            "expiry": "2025-01-31T16:24:08.508Z",
            "savedtime": "2025-01-26T16:24:08.508Z"
        },
        {
            "id": "11923",
            "sku": "3946158",
            "pic": "https://img-c.udemycdn.com/course/750x422/3946158_b092_4.jpg",
            "title": "SAP for Beginners – Get Started with SAP",
            "coupon": "https://www.udemy.com/course/sap-for-beginners-understanding-sap-the-easy-way/?couponCode=NEWYEARSAVINGS3",
            "org_price": "$9.99",
            "desc_text": "CHECK OUT OUR WEBSITE LINK FOR BLACK FRIDAY DEALS\nThis course is perfect for you, if you want to learn how you can use SAP and to understand how SAP works.\nYou will learn what SAP exactly is and how you can use it. You will first gain valuable knowledge by understanding the business processes that are conducted in every organization. Based on that acquired process know-how you will learn how to post these business processes directly in SAP. You will build up valuable practical capabilities and a deep understanding of concepts of SAP as an ERP-System. All demonstrational videos are recorded with the latest SAP S/4 HANA software.\nWhat qualifies me to teach you?\nMy name is Stefan and I’ve been working with SAP for almost a decade. That means I have set up SAP systems for many different companies and in various countries in Europe and the US across all kind of industries. During that time I held countless user trainings and gained the capability to teach SAP efficiently and effectively.\nAfter completing this course you will be able to process important documents in SAP like a sales order or a purchase order. That means you are not only able to sell goods and to procure services in the SAP system but you will also be able to ship goods to a customer and to bill a customer. Additionally you will know how to work effectively and efficiently by using high quality master data. You will understand the importance of customer and material master data in detail.\nThis course is particularly suitable for you, if you are\n– SAP Beginner without practical experience in SAP\n– Experienced in only one SAP module and want to expand your knowledge to other modules now\n– Software developer and if you want to understand how business processes are realized in SAP\nThis course is not right for you if you have already in dept knowledge of SAP – This is a beginners course.\nThere are no requirements that you need to fulfill to start this course – it is a beginners course. You can start right away\nMy Promise to You\nI’m an experienced SAP consultant and online teacher. I’ll guide you step by step. If you have any questions about the course content or anything related to this topic, you can always post a question in the course or send me a direct message.\nThis course focuses mainly on logistic processes. Processes in Accounting are mentioned in this course too, but are not the main focus.\nPlease note: This course doesn’t provide access to an SAP system. It will help a bit if you have access to an SAP System where you can practice. But this course is designed in a way that doesn’t require you to have access to an SAP-system.",
            "category": "IT & Software",
            "language": "English",
            "platform": "Udemy",
            "rating": 4.54,
            "duration": 3,
            "expiry": "2025-01-31T16:24:08.508Z",
            "savedtime": "2025-01-26T16:24:08.508Z"
        },
        {
            "id": "11924",
            "sku": "5936654",
            "pic": "https://img-c.udemycdn.com/course/750x422/5936654_59ba.jpg",
            "title": "Business Development Mastery: Growth Strategies for Success",
            "coupon": "https://www.udemy.com/course/business-development-mastery-growth-strategies-for-success/?couponCode=9AD9B705F01EF3BEAF0A",
            "org_price": "$9.99",
            "desc_text": "Our journey through “Business Development: Growth Strategies for Success” is structured around several key objectives, each designed to enhance your strategic acumen and operational effectiveness:\nEvaluate Business Development Strategies: Learn how to assess the effectiveness of various business development strategies in achieving organizational goals.\nApply Market Analysis Techniques: Master the art of market analysis to identify untapped opportunities and areas for potential growth.\nDevelop Strategic Partnerships and Sales Plans: Craft detailed plans for building strategic partnerships and robust sales strategies that align with company targets and market demands.\nUtilise Customer Data in CRM: Analyse and leverage customer data to refine customer relationship management processes and improve customer satisfaction.\nFormulate Networking and Innovation Plans: Create actionable plans for networking and innovating new products or services, ensuring your business stays ahead of the curve.\nThe course is divided into several comprehensive modules, each focusing on a different aspect of business development:\n1. Customer Relationship Management (CRM): Techniques for analysing customer data and feedback to enhance interaction strategies and loyalty programs.\n2. Networking: Strategies for developing a networking plan that outlines your goals and identifies key connections to build your business influence.\n3. Innovation in Product/Service Development: Application of creativity and innovation frameworks to conceive and develop new offerings.\n4. International Expansion: Exploration of market entry strategies for launching your business in foreign markets.\n5. Pricing Strategies: Examination of various pricing models and strategies to maximize revenue and profitability.\n6. Digital Marketing: Development of a digital marketing plan that targets your audience with precision and creatively engages them through relevant content.\n7. Strategic Execution: Techniques to outline and manage the execution of business strategies efficiently.\n8. Financial Assessment: Tools to analyse the financial health of business ventures and investment decisions.\n9. Risk Management: Strategies to create tailored risk management and business continuity plans.\n10.Time Management: Best practices in time management to optimize productivity and ensure project deadlines are met.\nLearning Outcomes\nBy the end of this course, you will have acquired a toolkit of skills that will enable you to craft detailed business development plans, implement effective marketing strategies, and manage operational challenges efficiently. These capabilities will empower you to not only achieve but also exceed your organizational objectives, fostering growth and innovation within your business.\n” Business Development Mastery: Growth Strategies for Success”” is more than just a course; it’s a transformative journey for ambitious business leaders ready to take their companies to new heights. Join us to unlock the potential of your business, harness growth opportunities, and lead with confidence and strategic insight.",
            "category": "Business",
            "language": "English",
            "platform": "Udemy",
            "rating": 4.94,
            "duration": 2,
            "expiry": "2025-01-31T16:24:08.508Z",
            "savedtime": "2025-01-26T16:24:08.508Z"
        },
        {
            "id": "11925",
            "sku": "5832228",
            "pic": "https://img-c.udemycdn.com/course/750x422/5832228_0be6.jpg",
            "title": "Graphic Design Masterclass: Master Illustrator & Photoshop",
            "coupon": "https://www.udemy.com/course/graphic-design-masterclass-master-illustrator-photoshop/?couponCode=A1151B772775971D6349",
            "org_price": "$9.99",
            "desc_text": "Unleash Your Creativity: Graphic Design with Illustrator & Photoshop\nTransform your ideas into stunning visuals with this beginner-friendly course!\nMaster the in-demand skills of graphic design using the industry’s leading software: Adobe Illustrator and Adobe Photoshop. This comprehensive course equips you with the essential knowledge and practical techniques to create professional-quality graphics from scratch.\nDive Deep:\nGraphic Design Fundamentals: Grasp core principles like color theory, composition, and typography for impactful designs.\nAdobe Illustrator: Craft scalable vector graphics for logos, illustrations, icons, and more, with proficiency in Illustrator’s tools.\nAdobe Photoshop: Unlock the potential of Photoshop for photo editing, digital painting, and image manipulation, bringing your creative vision to life.\nDesign Harmony: Learn to seamlessly integrate Illustrator and Photoshop to create cohesive and professional-grade graphics.\nReal-World Projects: Apply your newfound skills to practical projects, designing logos, brochures, posters, captivating social media graphics, and more.\nBy the end of this course, you’ll be able to:\nBecome a Design Powerhouse: Navigate both Adobe Illustrator and Photoshop with confidence to bring your design ideas to life.\nDesign with Impact: Effectively utilize design principles to elevate your creative projects and impress your audience.\nCraft Professional Graphics: Produce high-quality graphics for diverse needs, from marketing materials to engaging social media content.\nIs this course right for you?\nThis course is your perfect launchpad if you’re a complete beginner with no prior design experience or someone looking to refine your existing graphic design skills.\nLevel Up Your Skills:\nFlexible Learning: Tailor your learning journey with on-demand video lectures, downloadable resources, and practice exercises.\nExpert Instruction: Gain valuable insights from an experienced instructor in the graphic design field.\nEngaging Community: Connect with fellow aspiring designers and share your creative journey within the course community.\nDon’t wait! Enroll today and unlock your creative potential in the world of graphic design!",
            "category": "Design",
            "language": "English",
            "platform": "Udemy",
            "rating": 4.33,
            "duration": 8,
            "expiry": "2025-01-31T16:24:08.508Z",
            "savedtime": "2025-01-26T16:24:08.508Z"
        },
        {
            "id": "11926",
            "sku": "6130249",
            "pic": "https://img-c.udemycdn.com/course/750x422/6130249_f3ad_2.jpg",
            "title": "AI Superkids: Fun & Practical AI Skills for Beginners",
            "coupon": "https://www.udemy.com/course/ai-superkids-fun-practical-ai-skills-for-beginners/?couponCode=276BBA8F699686B6E275",
            "org_price": "$9.99",
            "desc_text": "Course Description\nAre you worried that your child might fall behind in a rapidly changing, tech-driven world? Do you want them to learn skills that are practical, fun, and future-ready? You’re not alone—many parents struggle to find engaging ways to equip their children for the future.\nThat’s where AI Superkids comes in! This course is designed specifically for parents, guardians, and educators who want to guide kids through mastering 9 essential AI skills. Whether your child is naturally tech-savvy or needs a boost of confidence, this course will help them build skills they’ll use for school, creativity, and beyond.\nWhat Will You Learn?\nBy enrolling in this course, you’ll gain the tools to teach your child how to:\nUnderstand and Use AI Tools: Make AI part of everyday tasks.\nDesign Flyers & Posters: Create eye-catching visuals for projects and hobbies.\nCreate Music: Compose unique tunes with AI music tools.\nMake Presentations: Build polished slideshows for school and personal ideas.\nSimplify Studies with AI: Use AI to assist with homework, research, and productivity.\nSet Up a Google Account: Navigate Gmail, Drive, and more.\nCreate Images: Generate stunning AI-powered visuals.\nDesign Logos: Spark creativity by making logos and branding ideas.\nWrite Stories & Essays: Use AI to brainstorm, draft, and polish creative writing.\nWhy This Course Is the Solution\n* 1: “I don’t know how to teach my child about technology.”\nSolution: We provide step-by-step lessons and hands-on projects that make it easy for you to guide your child, even if you’re not tech-savvy.\n* 2: “I want my child to learn skills that matter for the future.”\nSolution: Your child will develop practical, creative, and future-ready skills that are already shaping industries today.\n* 3: “I don’t have time to create my own curriculum for my child.”\nSolution: This ready-to-go course simplifies learning with clear instructions, fun projects, and no extra prep work for you!\n* 4: “Technology feels overwhelming for kids and parents alike.”\nSolution: We break everything down into manageable lessons, helping kids and adults feel confident and excited about using AI.\nWho Is This Course For?\nThis course is for adults who want to teach kids essential AI skills:\nParents or guardians looking for an engaging, educational activity to share with their children.\nEducators who want to introduce students to technology in a fun, practical way.\nAnyone who wants to help children build confidence and creativity in a tech-driven world.\nRequirements\nA laptop or desktop computer with internet access.\nA free Google account for some activities.\nBasic computer skills (e.g., navigating a browser).\nWillingness to guide and support your child as they explore AI!\nDon’t let your child fall behind in a tech-driven world. Enroll in AI Superkids today and help them master the skills they need to thrive—with your guidance!",
            "category": "Other Teaching & Academics",
            "language": "English",
            "platform": "Udemy",
            "rating": 4,
            "duration": 2,
            "expiry": "2025-01-31T16:24:08.508Z",
            "savedtime": "2025-01-26T16:24:08.508Z"
        },
        {
            "id": "11927",
            "sku": "5854496",
            "pic": "https://img-c.udemycdn.com/course/750x422/5854496_fe6b.jpg",
            "title": "Learn Figma: UI/UX Design Masterclass From Beginner to Pro",
            "coupon": "https://www.udemy.com/course/learn-figma-uiux-design-masterclass-from-beginner-to-pro/?couponCode=C70FEAB595A248B2B966",
            "org_price": "$9.99",
            "desc_text": "Welcome to our class of figma uiux beginner tutorial for learning how to use figma for uiux so if you are planning to learn how to use figma from the beginning then you are in the right place because we will cover in this. This class covers the basics so if you have any prior experience than it might be helpful for you to understand this class properly, if not then don’t worry as we will be teaching you all that you need to know as we go.\nLet’s take a look at what you will be learning from this course;\n1. Interface & Workspace\n2. Tools & Utilities\n3. Understanding Layers & Pages\n4. Adding & Designing Text\n5. Creating Wireframes\n6. Button\n7. Smart Selection % Tidy\n8. Input Fields\n9. Prototyping & Animation\n10. Smart Animations & Micro Interaction\n11. Collaborating in Figma\n12. Organizing and optimising work using Grids\n13. Colour theory & Colour Tools\n14. Using colour Gradients & Layouts\n15. Making a Placeholder Image\n16. Masking and cropping\nAfter Completing this Class, you will be able to\n· Use Figma to make basic UIUX Designs\n· Use the interface to utilize and enhance productivity\n· Colour Grade\n· Export in more advance and customized settings\n· Optimise Workflow\n· Do Project Examples\nNow do keep this in mind that is a project-based Course, so at the end of all the classes you will have a class project that will enable you to actively participate in them to practice or refine what you have learned throughout the entire course. You will be provided with supporting resources so it will become easier to learn as we go.\nDuring Learning if you have any queries or problem then do feel free to ask me. I will always be available to help if needed. So let us go ahead and start.",
            "category": "Design",
            "language": "English",
            "platform": "Udemy",
            "rating": 4.2,
            "duration": 4,
            "expiry": "2025-01-31T16:24:08.508Z",
            "savedtime": "2025-01-26T16:24:08.508Z"
        }
    ]
}